// 5. Написать программу вычисления значения функции y=f(a)
int x = 3;
int y = x * x - 1;
Console.WriteLine(y);

