// 5. Написать программу вычисления значения функции y=f(a)
int x = 6;
int y = x * x - 5;
Console.WriteLine(y);

// p.s. эту задачу я не совсем понял, призвал на помощь гугл, который выдал это: f(x)=x2−5, 
// от чего я и отталкивался
// p.p.s. за незнание y=f(a) стыдно