// 5. Написать программу вычисления значения функции y=f(a)
int Findfotx(int x1)
{
int x = x1;
int y = x * x - 1;
return y;
}
Console.WriteLine(Findfotx(5));

